package com.business.util.resume;

import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class NameKu {

	public static void main(String[] args) {
		String s = "郭洪江 手机 :18600368768	男    29岁(1984年10月)    8年工作经验    大专    已婚 	 手机 ：13910931707 男    35岁(1977年1月)    10年工作经验    大专    已婚 现居住地：北京 昌平区 | 户口：娄底 | 无党派人士";
		System.out.println(getNameByKu(s));
	}

	public static String getNameByKu(String nofe) {
		String myName = "";
		// 百家姓词库
		String name = nameproduce();
		name = name.replaceAll(",", "|");
		Pattern ps = Pattern.compile("(" + name + ")");
		Matcher ms = ps.matcher(nofe);
		if (ms.find()) {
			String xing = ms.group();
			nofe = nofe.replaceAll(xing + "\\s{1,}", xing);
			Pattern p = Pattern.compile(xing + "[\u4E00-\u9FA5]{1,2}");
			Matcher m = p.matcher(nofe);
			if (m.find()) {
				myName = m.group().trim();
			}
		}
		return myName;
	}

	public static String nameproduce() {
		String name = "赵,钱,孙,李,周,吴,尹,凌,郑,卜,王,沙,冯,付,玉,寻,晏,盛,肖,卢,麻,卿,童,蔺,单,阳,哈,解,陈,褚,郇,卫,蒋,沈,邸,靳,树,门,才,道,韩,覃,杨,朱,秦,尤,许,何,吕,闫,张,孔,曹,喻,祥,严,垡,金,魏,陶,姜,戚,谢,邹,窦,章,苏,葛,潘,范,彭,施,郎,鲁,韦,马,苗,花,方,俞,任,袁,柳,鲍,史,唐,费,岺,薛,雷,贺,汤,滕,殷,罗,齐,郝,毕,安,常,于,曲,傅,康,伍,余,顾,孟,黄,穆,萧,姚,饶,暨,邵,亢,汪,祁,毛,臧,成,戴,宋,庞,熊,纪,舒,项,祝,董,梁,杜,阮,蓝,闵,季,贾,路,江,颜,郭,梅,林,刁,钟,徐,邱,骆,高,夏,蔡,田,樊,胡,兰,万,管,占,索,莫,丁,邓,洪,石,崔,龚,裴,邢,陆,左,段,焦,谷,车,侯,宁,武,刘,龙,叶,景,詹,黎,白,宴,赖,直,蒙,乔,党,翟,谭,冉,桑,牛,边,温,庄,楚,阎,涂,迟,官,向,易,廖,耿,匡,文,欧,聂,曾,关,岳,丛,隋,苟,奚,皮,娄,霍,虞,包,班,仲,仇,屠,闻,艾,房,濮,尚,柴,连,满,寇,师,巩,鞠,竺,郁,欧阳,司马,上官,夏侯,东方,长孙,";
		String name2="薄,邬,宗,燕,芦,冷,莉,辛,瞿,智,逄,申,果,南,荆,柏,佘,帅,綦,吉,苑,栗,要,符,牟,代,狄,云,佟,支,剧,富,奉,祖,米,修,全,姬,阴,战,邰,柯,和,应,栾,楼,火,国,逯,茹,苍,冀,伏,籍,荣,娜,恩,宫,阙,郗,种,靖,权,甄,鄢,宇,井,候,胥,缑,呙,立,廉,盖,静,游,漆,雪,蒲,惠,明,弘,凡,仝,展,戈,华,巢,隗,宣,相,涛,塔,扈,折,裘,生,杭,阿,元,郐,时,回,辇,布,母,戎,益,伊,嵇,卓,公,问,硕,泰,皇,及,化,槐,延,楊,古,池,甘,巨,郜,衣,宿,敖,竹,邝,初,强,暴,倪,信,昝,都,浦,胖,卞,丰,谈,尉,贲,阚,香,宾,虎,屈,隆,勾,海,厍,揣,朴,鹿,扶,赛,晋,缪,谌,位,禄,贠,桂,湛,老,亓,旷,焉,县,宝,巫,赫,筵,清,计,封,敬,拓,蹇,晓,步,凤,况,席,轩,昌,郦,敦,类,青,礼,原,利,乐,禚,師,蓟,奎,尔,越,那,厉,巴,乌,幸,邳,崇,平,厚,宓,干,徒,禹,藏,翁,渠,具,怀,遇,畅,冶,夜,履,零,伯,蔚,乜,别,居,灰,旋,句,基,迁,宛,劉,松,弓,拜,芮,慕,印,吁,储,达,滑,荀,岑,於,玄,可";
		return name+name2;
	}

}
